out/CVE-2025-59287/probe-input.json

{
  "requests": [
    {
      "method": "POST",
      "uri": "/ReportingWebService/ReportingWebService.asmx",
      "headers": {
        "Accept": "text/xml",
        "Connection": "keep-alive",
        "Content-Type": "text/xml",
        "SOAPAction": "http://www.microsoft.com/SoftwareDistribution/ReportEventBatch"
      },
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\"><soap:Body><ReportEventBatch xmlns=\"http://www.microsoft.com/SoftwareDistribution\"><cookie><Expiration>2025-10-29T08:41:54Z</Expiration><EncryptedData>AAAAAQAAAAEAAAABAAAA</EncryptedData></cookie><clientTime>2025-10-29T08:41:54Z</clientTime><eventBatch xmlns:q1=\"http://www.microsoft.com/SoftwareDistribution\" soapenc:arrayType=\"q1:ReportingEvent[1]\"><ReportingEvent><BasicData><TargetID><Sid>549743e5-8546-4f9d-b946-7948711f7b69</Sid></TargetID><SequenceNumber>0</SequenceNumber><TimeAtTarget>2025-10-29T08:41:54.069</TimeAtTarget><EventInstanceID>a0ce0892-6046-4f21-856e-69ffa43876b9</EventInstanceID><NamespaceID>2</NamespaceID><EventID>389</EventID><SourceID>301</SourceID><UpdateID><UpdateID>00000000-0000-0000-0000-000000000000</UpdateID><RevisionNumber>0</RevisionNumber></UpdateID><Win32HResult>0</Win32HResult><AppName>LocalServer</AppName></BasicData><ExtendedData><MiscData soapenc:arrayType=\"xsd:string[2]\"><string>Administrator=SYSTEM</string><string>testpayload</string></MiscData></ExtendedData><PrivateData><ComputerDnsName></ComputerDnsName><UserAccountName></UserAccountName></PrivateData></ReportingEvent></eventBatch></ReportEventBatch></soap:Body></soap:Envelope>"
    }
  ],
  "paranoia": 2
}
